ARMmbed/DAPLink/source/hic_hal/stm32/stm32h743xx/usbd_STM32H7xx_HS.c
/*
 * Copyright (c) 2004-2013,2022 ARM Limited. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/*----------------------------------------------------------------------------
 *      RL-ARM - USB
 *----------------------------------------------------------------------------
 *      Name:    usbd_STM32H7xx_HS.c (based on usbd_STM32F4xx_HS.c)
 *      Purpose: Hardware Layer module for ST STM32H743
 *      Rev.:    V4.70
 *----------------------------------------------------------------------------
 *      This code is part of the RealView Run-Time Library.
 *      Copyright (c) 2004-2013 KEIL - An ARM Company. All rights reserved.
 *---------------------------------------------------------------------------*/

#include <rl_usb.h>
#include <stdio.h>
#include "stm32h7xx.h"
#include "cmsis_gcc.h"
#include "usb_def.h"
#include "util.h"
#include "IO_Config.h"

#define __NO_USB_LIB_C
#include "usb_config.c"

#define OTG             USB1_OTG_HS
#define USBx_BASE       USB1_OTG_HS_PERIPH_BASE
#define USBx_DEVICE     ((USB_OTG_DeviceTypeDef *)(USBx_BASE + USB_OTG_DEVICE_BASE))

// 00: Control, 01: Isochronous, 10: Bulk, 11: Interrupt
#define EP_IN_TYPE(num)     ((USBx_INEP(num)->DIEPCTL & USB_OTG_DIEPCTL_EPTYP) >> USB_OTG_DIEPCTL_EPTYP_Pos)
#define EP_OUT_TYPE(num)    ((USBx_OUTEP(num)->DOEPCTL & USB_OTG_DOEPCTL_EPTYP) >> USB_OTG_DOEPCTL_EPTYP_Pos)

#define RX_FIFO_SIZE    1024    // RX MAX
#define TX0_FIFO_SIZE   64      // EP0 MAX
#define TX1_FIFO_SIZE   512
#define TX2_FIFO_SIZE   512
#define TX3_FIFO_SIZE   128     // Interrupt EP, reduced to meet the 4kB total size limit
#define TX4_FIFO_SIZE   512
#define TX5_FIFO_SIZE   128     // Interrupt EP, reduced to meet the 4kB total size limit
#define TX6_FIFO_SIZE   512
#define TX7_FIFO_SIZE   128     // Interrupt EP, reduced to meet the 4kB total size limit
#define TX8_FIFO_SIZE   512

// This chip has 4kB shared RAM for the FIFOs. Check if the FIFOs combined are within this limit.
COMPILER_ASSERT((RX_FIFO_SIZE + TX0_FIFO_SIZE + TX1_FIFO_SIZE + TX2_FIFO_SIZE + TX3_FIFO_SIZE +
                 TX4_FIFO_SIZE + TX5_FIFO_SIZE + TX6_FIFO_SIZE + TX7_FIFO_SIZE + TX8_FIFO_SIZE)
                 <= 4096);

// If a change to the FIFO sizes is required, first investigate the max packet size
// and the driver for the respective endpoints.
// If the EP definitions change, update the TX FIFO sizes and InPacketDataPtr respectively
COMPILER_ASSERT((USBD_BULK_EP_BULKIN == 1) && (USBD_BULK_HS_WMAXPACKETSIZE <= TX1_FIFO_SIZE));
COMPILER_ASSERT((USBD_MSC_HS_ENABLE == 1) && (USBD_MSC_EP_BULKIN == 2) && (USBD_MSC_HS_WMAXPACKETSIZE <= TX2_FIFO_SIZE));
COMPILER_ASSERT(USBD_CDC_ACM_1_EP_INTIN == 3);
COMPILER_ASSERT((USBD_CDC_ACM_1_HS_ENABLE == 1) && (USBD_CDC_ACM_1_EP_BULKIN == 4) && (USBD_CDC_ACM_1_HS_WMAXPACKETSIZE<= TX4_FIFO_SIZE));
COMPILER_ASSERT(USBD_CDC_ACM_2_EP_INTIN == 5);
COMPILER_ASSERT((USBD_CDC_ACM_2_HS_ENABLE == 1) && (USBD_CDC_ACM_2_EP_BULKIN == 6) && (USBD_CDC_ACM_2_HS_WMAXPACKETSIZE <= TX6_FIFO_SIZE));
COMPILER_ASSERT(USBD_CDC_ACM_3_EP_INTIN == 7);
COMPILER_ASSERT((USBD_CDC_ACM_3_HS_ENABLE == 1) && (USBD_CDC_ACM_3_EP_BULKIN == 8) && (USBD_CDC_ACM_3_HS_WMAXPACKETSIZE <= TX8_FIFO_SIZE));
#define TXFIFO_WAIT_TIMEOUT_MS    (5)

#if defined(DAPLINK_IF) && defined(UDB)
// Use larger descriptor size. After enabling the multiple CDC EPs and the MSC EP, the config
// descriptor size will exceed the original defined size 200.
#define UDB_USBD_CONFIG_DESCRIPTOR_SIZE   (400)
U8 USBD_ConfigDescriptor[UDB_USBD_CONFIG_DESCRIPTOR_SIZE] = { 0 };
#if (USBD_HS_ENABLE == 0)
U8 USBD_ConfigDescriptor_HS[] = { 0 };
#else
U8 USBD_ConfigDescriptor_HS[UDB_USBD_CONFIG_DESCRIPTOR_SIZE] = { 0 };
#endif
#endif

#if (USBD_HID_ENABLE == 1)
static uint32_t HID_IntInPacketData[(USBD_HID_MAX_PACKET + 3) / 4];
#endif

#if (USBD_CDC_ACM_ENABLE == 1)
static uint32_t CDC_ACM_IntInPacketData[USB_CDC_ACM_EP_COUNT][(USBD_CDC_ACM_MAX_PACKET + 3) / 4];
#endif

static uint32_t *InPacketDataPtr[USBD_EP_NUM] =
{
/* endpoint 0 */
    0,
/* endpoint 1 */
#if ((USBD_HID_ENABLE == 1) && (USBD_HID_EP_INTIN == 1))
    HID_IntInPacketData,
#elif (USBD_EP_NUM > 1)
    0,
#endif
/* endpoint 2 */
#if (USBD_EP_NUM > 2)
    0,
#endif
/* endpoint 3 */
#if ((USBD_CDC_ACM_ENABLE == 1) && (USBD_CDC_ACM_1_EP_INTIN == 3))
    CDC_ACM_IntInPacketData[0],
#elif (USBD_EP_NUM > 3)
    0,
#endif
/* endpoint 4 */
#if (USBD_EP_NUM > 4)
    0,
#endif
/* endpoint 5 */
#if ((USBD_CDC_ACM_ENABLE == 1) && (USB_CDC_ACM_EP_COUNT > 1) && (USBD_CDC_ACM_2_EP_INTIN == 5))
    CDC_ACM_IntInPacketData[1],
#elif (USBD_EP_NUM > 5)
    0,
#endif
/* endpoint 6 */
#if (USBD_EP_NUM > 6)
    0,
#endif
/* endpoint 7 */
#if ((USBD_CDC_ACM_ENABLE == 1) && (USB_CDC_ACM_EP_COUNT > 2) && (USBD_CDC_ACM_3_EP_INTIN == 7))
    CDC_ACM_IntInPacketData[2],
#elif (USBD_EP_NUM > 7)
    0,
#endif
/* endpoint 8 */
#if (USBD_EP_NUM > 8)
    0,
#endif
};

static uint32_t OutMaxPacketSize[USBD_EP_NUM];
static uint8_t  OutPacketCnt[USBD_EP_NUM];
static uint8_t  InPacketCnt[USBD_EP_NUM];
static uint32_t InPacketDataCnt[USBD_EP_NUM];
static uint32_t InPacketDataReady;
static uint32_t SyncWriteEP;

/*
 *  USB Device Interrupt enable
 *   Called by USBD_Init to enable the USB Interrupt
 *    Return Value:    None
 */

static void USBD_IntrEna(void)
{
    NVIC_EnableIRQ(OTG_HS_IRQn); /* Enable OTG_HS interrupt */
}

static void reset_usbhub_cy7c65642_28ltxc(void)
{
    HAL_GPIO_WritePin(USBHUB_RESET_L_PORT, USBHUB_RESET_L_PIN, GPIO_PIN_RESET);
    HAL_Delay(1);
    HAL_GPIO_WritePin(USBHUB_RESET_L_PORT, USBHUB_RESET_L_PIN, GPIO_PIN_SET);
    HAL_Delay(1);
}

static void reset_external_phy_usb3320c_ezk(void)
{
    HAL_GPIO_WritePin(USBPHY_RESET_L_PORT, USBPHY_RESET_L_PIN, GPIO_PIN_RESET);
    HAL_Delay(1);
    HAL_GPIO_WritePin(USBPHY_RESET_L_PORT, USBPHY_RESET_L_PIN, GPIO_PIN_SET);
    // T_start in USB3320c-ezk datasheet
    HAL_Delay(4);
}

