ARMmbed/DAPLink/source/hic_hal/stm32/stm32h743xx/usbd_STM32H7xx_HS.c
/*
 *  USB Device Initialize Function
 *   Called by the User to initialize USB
 *   Return Value:    None
 */

void USBD_Init(void)
{
    int32_t timeout_cntr;
    GPIO_InitTypeDef gpio_init_struct;

    // PA5 (OTG_HS_ULPI alternate function, CLOCK)
    gpio_init_struct.Pin = GPIO_PIN_5;
    gpio_init_struct.Mode = GPIO_MODE_AF_PP;
    gpio_init_struct.Pull = GPIO_NOPULL;
    gpio_init_struct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    gpio_init_struct.Alternate = GPIO_AF10_OTG1_HS;
    HAL_GPIO_Init(GPIOA, &gpio_init_struct);

    // ULPI data pins
    // PA3 (OTG_HS_ULPI alternate function, DATA0)
    gpio_init_struct.Pin = GPIO_PIN_3;
    gpio_init_struct.Mode = GPIO_MODE_AF_PP;
    gpio_init_struct.Pull = GPIO_NOPULL;
    gpio_init_struct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    gpio_init_struct.Alternate = GPIO_AF10_OTG1_HS;
    HAL_GPIO_Init(GPIOA, &gpio_init_struct);

    // PB0, PB1 (OTG_HS_ULPI alternate function, DATA1, DATA2)
    // PB10..13 (OTG_HS_ULPI alternate function, DATA3 to DATA6)
    // PB5 (OTG_HS_ULPI alternate function, DATA7)
    gpio_init_struct.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_5 |
                           GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_13;
    gpio_init_struct.Mode = GPIO_MODE_AF_PP;
    gpio_init_struct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    gpio_init_struct.Pull = GPIO_NOPULL;
    gpio_init_struct.Alternate = GPIO_AF10_OTG1_HS;
    HAL_GPIO_Init(GPIOB, &gpio_init_struct);

    // ULPI control pins
    // PC0 (OTG_HS_ULPI alternate function, STP)
    gpio_init_struct.Pin = GPIO_PIN_0;
    gpio_init_struct.Mode = GPIO_MODE_AF_PP;
    gpio_init_struct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    gpio_init_struct.Pull = GPIO_NOPULL;
    gpio_init_struct.Alternate = GPIO_AF10_OTG1_HS;
    HAL_GPIO_Init(GPIOC, &gpio_init_struct);

    // PH4 (OTG_HS_ULPI alternate function, NXT)
    gpio_init_struct.Pin = GPIO_PIN_4;
    gpio_init_struct.Mode = GPIO_MODE_AF_PP;
    gpio_init_struct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    gpio_init_struct.Pull = GPIO_NOPULL;
    gpio_init_struct.Alternate = GPIO_AF10_OTG1_HS;
    HAL_GPIO_Init(GPIOH, &gpio_init_struct);

    // PI11 (OTG_HS_ULPI alternate functon, DIR)
    gpio_init_struct.Pin = GPIO_PIN_11;
    gpio_init_struct.Mode = GPIO_MODE_AF_PP;
    gpio_init_struct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    gpio_init_struct.Pull = GPIO_NOPULL;
    gpio_init_struct.Alternate = GPIO_AF10_OTG1_HS;
    HAL_GPIO_Init(GPIOI, &gpio_init_struct);

    gpio_init_struct.Pin = USBPHY_RESET_L_PIN;
    gpio_init_struct.Mode = GPIO_MODE_OUTPUT_PP;
    gpio_init_struct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    HAL_GPIO_Init(USBPHY_RESET_L_PORT, &gpio_init_struct);

    gpio_init_struct.Pin = USBHUB_RESET_L_PIN;
    gpio_init_struct.Mode = GPIO_MODE_OUTPUT_PP;
    gpio_init_struct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    HAL_GPIO_Init(USBHUB_RESET_L_PORT, &gpio_init_struct);

    __HAL_RCC_USB1_OTG_HS_ULPI_CLK_ENABLE();
    __HAL_RCC_USB1_OTG_HS_CLK_ENABLE();

    HAL_Delay(20);

    reset_external_phy_usb3320c_ezk();
    reset_usbhub_cy7c65642_28ltxc();

    timeout_cntr = 1000;
    while (!(OTG->GRSTCTL & USB_OTG_GRSTCTL_AHBIDL))
    {
        if (!timeout_cntr)
        {
            break;
        }
        timeout_cntr--;
        HAL_Delay(1);
    }
    OTG->GRSTCTL |= USB_OTG_GRSTCTL_CSRST;
    // reset otg core
    timeout_cntr = 1000;
    while (OTG->GRSTCTL & USB_OTG_GRSTCTL_CSRST)
    {
        if (!timeout_cntr)
        {
            break;
        }
        timeout_cntr--;
        HAL_Delay(1);
    }
    HAL_Delay(3);

    /* Keeping all the settings in the default reset state, except the below
     */
    USB_SetCurrentMode(OTG, USB_DEVICE_MODE);
    USB_SetDevSpeed(OTG, USB_OTG_SPEED_HIGH);

    OTG->GINTMSK =
        USB_OTG_GINTMSK_USBSUSPM |  // suspend int unmask
        USB_OTG_GINTMSK_USBRST |    // reset int unmask
        USB_OTG_GINTMSK_ENUMDNEM |  // enumeration done int unmask
        USB_OTG_GINTMSK_RXFLVLM |   // receive fifo non-empty int  unmask
        USB_OTG_GINTMSK_IEPINT |    // IN EP int unmask
        USB_OTG_GINTMSK_OEPINT |    // OUT EP int unmask
        USB_OTG_GINTMSK_WUIM |      // resume int unmask
        ((USBD_P_SOF_Event != 0) ? USB_OTG_GINTMSK_SOFM : 0); // SOF int unmask

    USBD_IntrEna(); // Enable OTG interrupt
    USB_EnableGlobalInt(OTG);
}

/*
 *  USB Device Connect Function
 *   Called by the User to Connect/Disconnect USB Device
 *    Parameters:      con:   Connect/Disconnect
 *    Return Value:    None
 */

void USBD_Connect(BOOL con)
{
    if (con)
    {
        USBx_DEVICE->DCTL &= ~USB_OTG_DCTL_SDIS; // soft disconnect disabled
    }
    else
    {
        USBx_DEVICE->DCTL |= USB_OTG_DCTL_SDIS; // soft disconnect enabled
    }
}

/*
 *  USB Device Reset Function
 *   Called automatically on USB Device Reset
 *    Return Value:    None
 */

void USBD_Reset(void)
{
    uint32_t fifo_offset;

    SyncWriteEP = 0;
    InPacketDataReady = 0;

    USB_StopDevice(OTG);

    for (uint32_t i = 0; i < (USBD_EP_NUM + 1); i++)
    {
        if (USBx_OUTEP(i)->DOEPCTL & USB_OTG_DOEPCTL_EPENA)
        {
            // OUT EP disable, Set NAK
            USBx_OUTEP(i)->DOEPCTL = USB_OTG_DOEPCTL_EPDIS | USB_OTG_DOEPCTL_SNAK;
        }
        if (USBx_INEP(i)->DIEPCTL & USB_OTG_DIEPCTL_EPENA)
        {
            // IN EP disable, Set NAK
            USBx_INEP(i)->DIEPCTL = USB_OTG_DIEPCTL_EPDIS | USB_OTG_DIEPCTL_SNAK;
        }
    }

    USBD_SetAddress(0, 1);

    USBx_DEVICE->DAINTMSK = (1 << USB_OTG_DAINTMSK_OEPM_Pos) | // unmask IN&OUT EP0 interrupts
                            (1 << USB_OTG_DAINTMSK_IEPM_Pos);
    USBx_DEVICE->DOEPMSK = USB_OTG_DOEPMSK_STUPM |  // setup phase done
                           USB_OTG_DOEPMSK_EPDM |   // endpoint disabled
                           USB_OTG_DOEPMSK_XFRCM;   // transfer complete
    USBx_DEVICE->DIEPMSK = USB_OTG_DIEPMSK_EPDM |   // endpoint disabled
                           USB_OTG_DIEPMSK_XFRCM;   // transfer completed
                           // USB_OTG_DIEPMSK_TOM   // the ref man suggest turning this on, but we'll also have to handle it then

    // Program the RX FIFO size
    OTG->GRXFSIZ = RX_FIFO_SIZE / 4;
    fifo_offset = RX_FIFO_SIZE;
    // Program the TX FIFO size for endpoint 0
    OTG->DIEPTXF0_HNPTXFSIZ = (fifo_offset / 4) | ((TX0_FIFO_SIZE / 4) << 16);
    fifo_offset += TX0_FIFO_SIZE;
    // Program the TX FIFO size for all other endpoints
    OTG->DIEPTXF[0] = (fifo_offset / 4) | ((TX1_FIFO_SIZE / 4) << 16);
    fifo_offset += TX1_FIFO_SIZE;
    OTG->DIEPTXF[1] = (fifo_offset / 4) | ((TX2_FIFO_SIZE / 4) << 16);
    fifo_offset += TX2_FIFO_SIZE;
    OTG->DIEPTXF[2] = (fifo_offset / 4) | ((TX3_FIFO_SIZE / 4) << 16);
    fifo_offset += TX3_FIFO_SIZE;
    OTG->DIEPTXF[3] = (fifo_offset / 4) | ((TX4_FIFO_SIZE / 4) << 16);
    fifo_offset += TX4_FIFO_SIZE;
    OTG->DIEPTXF[4] = (fifo_offset / 4) | ((TX5_FIFO_SIZE / 4) << 16);
    fifo_offset += TX5_FIFO_SIZE;
    OTG->DIEPTXF[5] = (fifo_offset / 4) | ((TX6_FIFO_SIZE / 4) << 16);
    fifo_offset += TX6_FIFO_SIZE;
    OTG->DIEPTXF[6] = (fifo_offset / 4) | ((TX7_FIFO_SIZE / 4) << 16);
    fifo_offset += TX7_FIFO_SIZE;
    OTG->DIEPTXF[7] = (fifo_offset / 4) | ((TX8_FIFO_SIZE / 4) << 16);

