ARMmbed/DAPLink/source/hic_hal/stm32/stm32h743xx/usbd_STM32H7xx_HS.c
    USBx_OUTEP(0)->DOEPTSIZ = USB_OTG_DOEPTSIZ_STUPCNT_0 | // setup count = 1
                              (USBD_OUT_PACKET_CNT0 << USB_OTG_DOEPTSIZ_PKTCNT_Pos) |  // packet count
                              USBD_MAX_PACKET0;

    OutMaxPacketSize[0] = USBD_MAX_PACKET0;
    OutPacketCnt[0] = USBD_OUT_PACKET_CNT0;
    InPacketCnt[0] = USBD_IN_PACKET_CNT0;
}

/*
 *  USB Device Suspend Function
 *   Called automatically on USB Device Suspend
 *    Return Value:    None
 */

void USBD_Suspend(void) {}

/*
 *  USB Device Resume Function
 *   Called automatically on USB Device Resume
 *    Return Value:    None
 */

void USBD_Resume(void) {}

/*
 *  USB Device Remote Wakeup Function
 *   Called automatically on USB Device Remote Wakeup
 *    Return Value:    None
 */

void USBD_WakeUp(void){}

/*
 *  USB Device Remote Wakeup Configuration Function
 *    Parameters:      cfg:   Device Enable/Disable
 *    Return Value:    None
 */

void USBD_WakeUpCfg(BOOL cfg) {}

/*
 *  USB Device Set Address Function
 *    Parameters:      adr:   USB Device Address
 *    Return Value:    None
 */

void USBD_SetAddress(U32 adr, U32 setup)
{
    if (setup)
    {
        USB_SetDevAddress(OTG, (uint8_t)adr);
    }
}

/*
 *  USB Device Configure Function
 *    Parameters:      cfg:   Device Configure/Deconfigure
 *    Return Value:    None
 */

void USBD_Configure(BOOL cfg)
{
    InPacketDataReady &= ~1UL;
}

/*
 *  Configure USB Device Endpoint according to Descriptor
 *    Parameters:      pEPD:  Pointer to Device Endpoint Descriptor
 *    Return Value:    None
 */

void USBD_ConfigEP(USB_ENDPOINT_DESCRIPTOR *pEPD)
{
    uint32_t num = (pEPD->bEndpointAddress & ~USB_ENDPOINT_DIRECTION_MASK);
    uint32_t val = pEPD->wMaxPacketSize;
    uint32_t type = (pEPD->bmAttributes & USB_ENDPOINT_TYPE_MASK);

    if (pEPD->bEndpointAddress & USB_ENDPOINT_DIRECTION_MASK)
    {
        InPacketCnt[num] = 1;

        USBx_DEVICE->DAINTMSK |= (1 << num);     // unmask IN EP int
        USBx_INEP(num)->DIEPCTL = (num << USB_OTG_DIEPCTL_TXFNUM_Pos) | // fifo number
                                  (type << USB_OTG_DIEPCTL_EPTYP_Pos) | // ep type
                                  (val & USB_OTG_DIEPCTL_MPSIZ);        // max packet size
        if ((type == USB_ENDPOINT_TYPE_BULK) || (type == USB_ENDPOINT_TYPE_INTERRUPT))
        {
            USBx_INEP(num)->DIEPCTL |= USB_OTG_DIEPCTL_SD0PID_SEVNFRM;
        }
    }
    else
    {
        OutMaxPacketSize[num] = val & USB_OTG_DOEPCTL_MPSIZ;
        OutPacketCnt[num] = 1;

        USBx_DEVICE->DAINTMSK |= (1 << (num + 16)); // unmask OUT EP int

        USBx_OUTEP(num)->DOEPCTL = (type << USB_OTG_DOEPCTL_EPTYP_Pos) |    // EP type
                                   (val & USB_OTG_DOEPCTL_MPSIZ);           // max packet size

        USBx_OUTEP(num)->DOEPTSIZ = (OutPacketCnt[num] << USB_OTG_DOEPTSIZ_PKTCNT_Pos) | // packet count
                                    (val & USB_OTG_DOEPCTL_MPSIZ);                       // transfer size
        if ((type == USB_ENDPOINT_TYPE_BULK) || (type == USB_ENDPOINT_TYPE_INTERRUPT))
        {
            USBx_OUTEP(num)->DOEPCTL |= USB_OTG_DOEPCTL_SD0PID_SEVNFRM;
        }
    }
}

/*
 *  Set Direction for USB Device Control Endpoint
 *    Parameters:      dir:   Out (dir == 0), In (dir <> 0)
 *    Return Value:    None
 */

void USBD_DirCtrlEP(U32 dir)
{
}

/*
 *  Enable USB Device Endpoint
 *    Parameters:      EPNum: Device Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USBD_EnableEP(U32 EPNum)
{
    if (EPNum & USB_ENDPOINT_DIRECTION_MASK)
    {
        EPNum &= ~USB_ENDPOINT_DIRECTION_MASK;
        USBx_INEP(EPNum)->DIEPCTL |= USB_OTG_DIEPCTL_USBAEP | // EP active
                                     USB_OTG_DIEPCTL_SNAK;    // set EP NAK
        if (USBx_INEP(EPNum)->DIEPCTL & USB_OTG_DIEPCTL_EPENA)
        {
            USBx_INEP(EPNum)->DIEPCTL |= USB_OTG_DIEPCTL_EPDIS; // disable EP
        }

        InPacketDataReady &= ~(1 << EPNum);
    }
    else
    {
        USBx_OUTEP(EPNum)->DOEPCTL |= USB_OTG_DOEPCTL_USBAEP |  // EP active
                                      USB_OTG_DOEPCTL_EPENA |   // enable EP
                                      USB_OTG_DOEPCTL_CNAK;     // clear EP NAK
    }
}

/*
 *  Disable USB Endpoint
 *    Parameters:      EPNum: Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USBD_DisableEP(U32 EPNum)
{
    uint32_t wcnt;

    // Disable IN Endpoint
    if (EPNum & USB_ENDPOINT_DIRECTION_MASK)
    {
        EPNum &= ~USB_ENDPOINT_DIRECTION_MASK;
        InPacketDataReady &= ~(1 << EPNum);

        if (USBx_INEP(EPNum)->DIEPCTL & USB_OTG_DIEPCTL_EPENA)
        {
            // disable EP
            USBx_INEP(EPNum)->DIEPCTL |= USB_OTG_DIEPCTL_EPDIS;
        }
        // set EP NAK
        USBx_INEP(EPNum)->DIEPCTL |= USB_OTG_DIEPCTL_SNAK;
        // deactivate EP
        USBx_INEP(EPNum)->DIEPCTL &= ~USB_OTG_DIEPCTL_USBAEP;

    }
    else
    {
        // Disable OUT Endpoint
        // set global out nak
        USBx_DEVICE->DCTL |= USB_OTG_DCTL_SGONAK;

        wcnt = 1000;
        while (!(OTG->GINTSTS & USB_OTG_GINTSTS_BOUTNAKEFF))
        {
            // wait until global NAK
            if ((wcnt--) == 0)
            {
                break;
            }
        }

        if (USBx_OUTEP(EPNum)->DOEPCTL & USB_OTG_DOEPCTL_EPENA)
        {
            // disable EP
            USBx_OUTEP(EPNum)->DOEPCTL |= USB_OTG_DOEPCTL_EPDIS;
        }
        // set EP NAK
        USBx_OUTEP(EPNum)->DOEPCTL |= USB_OTG_DOEPCTL_SNAK;
        //  deactivate EP
        USBx_OUTEP(EPNum)->DOEPCTL &= ~USB_OTG_DOEPCTL_USBAEP;

        wcnt = 1000;
        while (!(USBx_OUTEP(EPNum)->DOEPINT & USB_OTG_DOEPINT_EPDISD))
        {
            // wait until EP disabled
            if ((wcnt--) == 0)
            {
                break;
            }
        }
        // clear global nak
        USBx_DEVICE->DCTL |= USB_OTG_DCTL_CGONAK;
    }
}

