ARMmbed/DAPLink/source/hic_hal/stm32/stm32h743xx/usbd_STM32H7xx_HS.c
/*
 *  Reset USB Device Endpoint
 *    Parameters:      EPNum: Device Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USBD_ResetEP(U32 EPNum)
{
    // Reset IN Endpoint
    if (EPNum & USB_ENDPOINT_DIRECTION_MASK)
    {
        EPNum &= ~USB_ENDPOINT_DIRECTION_MASK;
        InPacketDataReady &= ~(1 << EPNum);
        if (USBx_INEP(EPNum)->DIEPCTL & USB_OTG_DIEPCTL_EPENA)
        {
            // disable EP
            USBx_INEP(EPNum)->DIEPCTL |= USB_OTG_DIEPCTL_EPDIS;
        }
        // set EP NAK
        USBx_INEP(EPNum)->DIEPCTL |= USB_OTG_DIEPCTL_SNAK;

        // Flush endpoint fifo
        USB_FlushTxFifo(OTG, EPNum);
    }
}

/*
 *  Set Stall for USB Device Endpoint
 *    Parameters:      EPNum: Device Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USBD_SetStallEP(U32 EPNum)
{
    uint32_t wcnt;

    if (!(EPNum & USB_ENDPOINT_DIRECTION_MASK))
    {
        // Stall OUT Endpoint

        // set global out nak
        USBx_DEVICE->DCTL |= USB_OTG_DCTL_SGONAK;
        wcnt = 1000;
        while (!(OTG->GINTSTS & USB_OTG_GINTSTS_BOUTNAKEFF))
        {
            // wait until global NAK
            if ((wcnt--) == 0)
            {
                break;
            }
        }

        if (USBx_OUTEP(EPNum)->DOEPCTL & USB_OTG_DOEPCTL_EPENA)
        {
            // disable EP
            USBx_OUTEP(EPNum)->DOEPCTL |= USB_OTG_DOEPCTL_EPDIS;
        }
        // set stall
        USBx_OUTEP(EPNum)->DOEPCTL |= USB_OTG_DOEPCTL_STALL;

        wcnt = 1000;
        while (!(USBx_OUTEP(EPNum)->DOEPINT & USB_OTG_DOEPINT_EPDISD))
        {
            // wait until EP disabled
            if ((wcnt--) == 0)
            {
                break;
            }
        }

        // clear global nak
        USBx_DEVICE->DCTL |= USB_OTG_DCTL_CGONAK;

    }
    else
    {
        // Stall IN endpoint
        EPNum &= ~USB_ENDPOINT_DIRECTION_MASK;
        if (USBx_INEP(EPNum)->DIEPCTL & USB_OTG_DIEPCTL_EPENA)
        {
            // disable endpoint
            USBx_INEP(EPNum)->DIEPCTL |= USB_OTG_DIEPCTL_EPDIS;
        }
        // set stall
        USBx_INEP(EPNum)->DIEPCTL |= USB_OTG_DIEPCTL_STALL;

        USB_FlushTxFifo(OTG, EPNum);
    }
}

/*
 *  Clear Stall for USB Device Endpoint
 *    Parameters:      EPNum: Device Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USBD_ClrStallEP(U32 EPNum)
{
    if (!(EPNum & USB_ENDPOINT_DIRECTION_MASK))
    {
        // Clear OUT endpoint Stall
        if (EP_OUT_TYPE(EPNum) > 1)
        {
            // if EP type Bulk or Interrupt
            // Set DATA0 PID
            USBx_OUTEP(EPNum)->DOEPCTL |= USB_OTG_DOEPCTL_SD0PID_SEVNFRM;
            // Clear stall
            USBx_OUTEP(EPNum)->DOEPCTL &= ~USB_OTG_DOEPCTL_STALL;
        }
    }
    else
    {
        // Clear IN Endpoint Stall
        EPNum &= ~USB_ENDPOINT_DIRECTION_MASK;

        if (USBx_INEP(EPNum)->DIEPCTL & USB_OTG_DIEPCTL_EPENA)
        {
            // disable endpoint
            USBx_INEP(EPNum)->DIEPCTL |= USB_OTG_DIEPCTL_EPDIS;
        }

        // Flush endpoint fifo
        USB_FlushTxFifo(OTG, EPNum);

        if (EP_IN_TYPE(EPNum) > 1)
        {
            // if Interrupt or bulk EP, Set DATA0 PID
            USBx_INEP(EPNum)->DIEPCTL |= USB_OTG_DIEPCTL_SD0PID_SEVNFRM;
        }

        // clear Stall
        USBx_INEP(EPNum)->DIEPCTL &= ~USB_OTG_DIEPCTL_STALL;
    }
}

/*
 *  Clear USB Device Endpoint Buffer
 *    Parameters:      EPNum: Device Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *    Return Value:    None
 */

void USBD_ClearEPBuf(U32 EPNum)
{
    if (EPNum & USB_ENDPOINT_DIRECTION_MASK)
    {
        EPNum &= ~USB_ENDPOINT_DIRECTION_MASK;
        USB_FlushTxFifo(OTG, EPNum);
    }
    else
    {
        USB_FlushRxFifo(OTG);
    }
}

/*
 *  Read USB Device Endpoint Data
 *    Parameters:      EPNum: Device Endpoint Number
 *                       EPNum.0..3: Address
 *                       EPNum.7:    Dir
 *                     pData: Pointer to Data Buffer
 *    Return Value:    Number of bytes read
 */

uint32_t USBD_ReadEP(U32 EPNum, U8 *pData, uint32_t bufsz)
{
    U32 val, sz;
    U32 pktsts;

    if ((USBx_OUTEP(EPNum)->DOEPCTL & USB_OTG_DOEPCTL_USBAEP) == 0)
    {
        // if Ep not active
        return (0);
    }

    sz = (OTG->GRXSTSP & USB_OTG_GRXSTSP_BCNT) >> USB_OTG_GRXSTSP_BCNT_Pos; // get available data size

    if (sz > bufsz)
    {
        // Read data from fifo. If there's not enough buffer space, still have to read the data
        // otherwise we never get a OUT/Setup transfer completed data packet and GRXSTSP pops
        // the wrong data and we might have lingering data in the RX FIFO. This shouldn't
        // happen, but if does, the drivers need more checks before reading the EP. Just abort
        // before something else goes wrong.
        util_assert(false);
    }
    else
    {
        for (val = 0; val < (uint32_t)((sz + 3) / 4); val++)
        {
            __UNALIGNED_UINT32_WRITE(pData, USBx_DFIFO(0U));
            pData += 4;
        }
    }

    // wait for OUT/Setup transfer completed data packet from USB core
    // Since USBD_Handler is heavy, we don't want to just pop single register in it
    // But it is possible that some packet gets into the FIFO before the core pushes
    // transfer completed packet. Verify it is really a transfer completed
    // packet and then pop it out.
    while ((OTG->GINTSTS & USB_OTG_GINTSTS_RXFLVL) == 0) {}
    pktsts = ((OTG->GRXSTSR & USB_OTG_GRXSTSP_PKTSTS) >> USB_OTG_GRXSTSP_PKTSTS_Pos);
    if ((pktsts == STS_XFER_COMP) || (pktsts == STS_SETUP_COMP))
    {
        OTG->GRXSTSP;
    }

    OTG->GINTMSK |= USB_OTG_GINTMSK_RXFLVLM;    // unmask RxFIFO non-empty interrupt

    return (sz);
}

