ARMmbed/DAPLink/source/hic_hal/stm32/stm32h743xx/usbd_STM32H7xx_HS.c
/*
 *  Write USB Device Endpoint Data
 *  If write was requested synchronously from IRQ then data is written to FIFO
 *  directly else data is written to the intermediate buffer and synchronously
 *  transferred to FIFO on next NAK event.
 *    Parameters:      EPNum: Device Endpoint Number
 *                        EPNum.0..3: Address
 *                        EPNum.7:    Dir
 *                     pData: Pointer to Data Buffer
 *                     cnt:   Number of bytes to write
 *    Return Value:    Number of bytes written
 */

uint32_t USBD_WriteEP(U32 EPNum, U8 *pData, U32 cnt)
{
    U32 *ptr, val;
    U32 txfifo_wait_start_time_ms;

    EPNum &= ~USB_ENDPOINT_DIRECTION_MASK;

    if ((USBx_INEP(EPNum)->DIEPCTL & USB_OTG_DIEPCTL_USBAEP) == 0)
    {
        // if Ep not active
        return (0);
    }

    /* Asynchronous write to intermediate buffer */
    if (!SyncWriteEP && InPacketDataPtr[EPNum])
    {
        if (!(InPacketDataReady & (1 << EPNum)))
        {
            InPacketDataCnt[EPNum] = cnt; /* save Data size */
            ptr = InPacketDataPtr[EPNum];
            val = (cnt + 3) / 4;
            if (val)
            {
                while (val--)
                {
                    // save data to intermediate buffer
                    *ptr++ = *((U32 *)pData);
                    pData += 4;
                }
            }
            InPacketDataReady |= 1 << EPNum;
            // Set NAK to enable interrupt on NAK
            USBx_INEP(EPNum)->DIEPCTL |= USB_OTG_DIEPCTL_SNAK;
            // INEPNEM = 1, IN EP NAK efective msk
            USBx_DEVICE->DIEPMSK |= USB_OTG_DIEPMSK_INEPNEM;
        }
        else
        {
            /* If packet already loaded to buffer */
            return 0;
        }
    }
    else
    {
        // get space in Ep TxFIFO
        // Reset the IN endpoint if we can't get enough space. Usually this
        // means something goes wrong on this endpoint and usb host stops
        // sending IN token.
        txfifo_wait_start_time_ms = HAL_GetTick();
        while (cnt > 0 && (USBx_INEP(EPNum)->DTXFSTS * 4) < cnt)
        {
            if (HAL_GetTick() - txfifo_wait_start_time_ms >= TXFIFO_WAIT_TIMEOUT_MS)
            {
                USBD_ResetEP(EPNum | USB_ENDPOINT_DIRECTION_MASK);
                return 0;
            }
        }

        // set transfer size and packet count
        USBx_INEP(EPNum)->DIEPTSIZ =
            cnt | (InPacketCnt[EPNum] << USB_OTG_DIEPTSIZ_PKTCNT_Pos) | (InPacketCnt[EPNum] << USB_OTG_DIEPTSIZ_MULCNT_Pos);

        // enable ep and clear NAK
        USBx_INEP(EPNum)->DIEPCTL |= USB_OTG_DIEPCTL_EPENA | USB_OTG_DIEPCTL_CNAK;
        if (cnt)
        {
            ptr = (uint32_t *)pData;
            val = (cnt + 3) / 4;
            while (val--)
            {
                // copy data to endpoint TxFIFO
                USBx_DFIFO((uint32_t)EPNum) = __UNALIGNED_UINT32_READ(pData);
                pData += 4;
            }
        }
        InPacketDataReady &= ~(1 << EPNum);
    }
    return (cnt);
}

/*
 *  Get USB Device Last Frame Number
 *    Parameters:      None
 *    Return Value:    Frame Number
 */

uint32_t USBD_GetFrame(void)
{
    return ((USBx_DEVICE->DSTS & USB_OTG_DSTS_FNSOF) >> USB_OTG_DSTS_FNSOF_Pos);
}

/*
 *  USB Device Interrupt Service Routine
 */
void OTG_HS_IRQHandler(void)
{
    NVIC_DisableIRQ(OTG_HS_IRQn);
    USBD_SignalHandler();
}

void USBD_Handler(void)
{
    uint32_t istr, val, num, i, msk;

    istr = OTG->GINTSTS & OTG->GINTMSK;

    // reset interrupt
    if (istr & USB_OTG_GINTSTS_USBRST)
    {
        USBD_Reset();
        usbd_reset_core();
        if (USBD_P_Reset_Event)
        {
            USBD_P_Reset_Event();
        }
        OTG->GINTSTS = USB_OTG_GINTSTS_USBRST;
    }

    // suspend interrupt
    if (istr & USB_OTG_GINTSTS_USBSUSP)
    {
        USBD_Suspend();
        if (USBD_P_Suspend_Event)
        {
            USBD_P_Suspend_Event();
        }
        OTG->GINTSTS = USB_OTG_GINTSTS_USBSUSP;
    }

    // resume interrupt
    if (istr & USB_OTG_GINTSTS_WKUINT)
    {
        USBD_Resume();
        if (USBD_P_Resume_Event)
        {
            USBD_P_Resume_Event();
        }
        OTG->GINTSTS = USB_OTG_GINTSTS_WKUINT;
    }

    // speed enumeration completed
    if (istr & USB_OTG_GINTSTS_ENUMDNE)
    {
        if ((USBx_DEVICE->DSTS & USB_OTG_DSTS_ENUMSPD) == DSTS_ENUMSPD_HS_PHY_30MHZ_OR_60MHZ)
        {
            USBD_HighSpeed = 1;
        }
        USBx_INEP(0)->DIEPCTL &= ~USB_OTG_DIEPCTL_MPSIZ;
        USBx_INEP(0)->DIEPCTL |= OutMaxPacketSize[0]; // EP0 max packet
        USBx_DEVICE->DCTL |= USB_OTG_DCTL_CGINAK;     // clear global IN NAK
        USBx_DEVICE->DCTL |= USB_OTG_DCTL_CGONAK;     // clear global OUT NAK
        OTG->GINTSTS |= USB_OTG_GINTSTS_ENUMDNE;
    }

    // Start Of Frame
    if (istr & USB_OTG_GINTSTS_SOF)
    {
        if (USBD_P_SOF_Event)
        {
            USBD_P_SOF_Event();
        }
        OTG->GINTSTS = USB_OTG_GINTSTS_SOF;
    }

    // RxFIFO non-empty
    if (istr & USB_OTG_GINTSTS_RXFLVL)
    {
        val = OTG->GRXSTSR;
        num = val & USB_OTG_GRXSTSP_EPNUM;

        switch ((val & USB_OTG_GRXSTSP_PKTSTS) >> USB_OTG_GRXSTSP_PKTSTS_Pos)
        {
            // setup packet
            case STS_SETUP_UPDT:
            {
                if (USBD_P_EP[num])
                {
                    USBD_P_EP[num](USBD_EVT_SETUP);
                }
                break;
            }

            // OUT packet
            case STS_DATA_UPDT:
            {
                OTG->GINTMSK &= ~USB_OTG_GINTMSK_RXFLVLM;
                if (USBD_P_EP[num])
                {
                    USBD_P_EP[num](USBD_EVT_OUT);
                }
                break;
            }
            // other valid packet types
            case STS_XFER_COMP:
            case STS_SETUP_COMP:
            {
                OTG->GINTMSK |= USB_OTG_GINTMSK_RXFLVLM;
                OTG->GRXSTSP;
                break;
            }
            case STS_GOUT_NAK:
            {
                OTG->GRXSTSP;
                break;
            }
            // We've seen bugs where we read non-valid packet info from the top of the FIFO,
            // log it in case there are other similar bugs
            default:
            {
                OTG->GRXSTSP;
                // Error: we are reading garbage packet status, so something went really wrong
                util_assert(false);
                break;
            }
        }
    }

    // OUT Packet
    if (istr & USB_OTG_GINTSTS_OEPINT)
    {
        msk = ((USBx_DEVICE->DAINT & USBx_DEVICE->DAINTMSK & USB_OTG_DAINTMSK_OEPM) >> USB_OTG_DAINTMSK_OEPM_Pos);
        i = 0;
        while (msk)
        {
            num = 0;
            for (; i < (USBD_EP_NUM + 1); i++)
            {
                if ((msk >> i) & 1)
                {
                    num = i;
                    msk &= ~(1 << i);
                    break;
                }
            }

            // Endpoint disabled
            if (USBx_OUTEP(num)->DOEPINT & USB_OTG_DOEPINT_EPDISD)
            {
                USBx_OUTEP(num)->DOEPINT |= USB_OTG_DOEPINT_EPDISD;
            }

            // Transfer complete interrupt
            if ((USBx_OUTEP(num)->DOEPINT & USB_OTG_DOEPINT_XFRC) | (USBx_OUTEP(num)->DOEPINT & USB_OTG_DOEPINT_STUP))
            {
                USBx_OUTEP(num)->DOEPTSIZ =
                    (OutPacketCnt[num] << USB_OTG_DOEPTSIZ_PKTCNT_Pos) | /* packet count */
                    (OutMaxPacketSize[num]);    /* transfer size */
                if (num == 0)
                {
                    USBx_OUTEP(0)->DOEPTSIZ |= USB_OTG_DOEPTSIZ_STUPCNT_0;
                }
                USBx_OUTEP(num)->DOEPCTL |= USB_OTG_DOEPCTL_EPENA | USB_OTG_DOEPCTL_CNAK;
                USBx_OUTEP(num)->DOEPINT |= USB_OTG_DOEPINT_XFRC;
            }
        }
    }

    // IN Packet
    if (istr & USB_OTG_GINTSTS_IEPINT)
    {
        msk = (USBx_DEVICE->DAINT & USBx_DEVICE->DAINTMSK & USB_OTG_DAINTMSK_IEPM);
        i = 0;
        while (msk)
        {
            num = 0;
            for (; i < (USBD_EP_NUM + 1); i++)
            {
                if ((msk >> i) & 1)
                {
                    num = i;
                    msk &= ~(1 << i);
                    break;
                }
            }

            // Endpoint disabled
            if (USBx_INEP(num)->DIEPINT & USB_OTG_DIEPINT_EPDISD)
            {
                USBx_INEP(num)->DIEPINT = USB_OTG_DIEPINT_EPDISD;
            }

            // IN endpoint NAK effective
            if (USBx_INEP(num)->DIEPINT & USB_OTG_DIEPINT_INEPNE)
            {
                if (InPacketDataPtr[num] &&
                    (InPacketDataReady & (1 << num)))
                {
                    SyncWriteEP = 1;
                    USBD_WriteEP(num, (uint8_t *)InPacketDataPtr[num],
                                 InPacketDataCnt[num]);
                    SyncWriteEP = 0;
                    if (!InPacketDataReady)
                    {
                        // No more pending IN transfers and disable IN NAK interrupts
                        USBx_DEVICE->DIEPMSK &= ~USB_OTG_DIEPMSK_INEPNEM;
                    }
                    continue;
                }
                else
                {
                    USBx_INEP(num)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK;
                }
                USBx_INEP(num)->DIEPINT = USB_OTG_DIEPINT_INEPNE;
            }

            // Transmit completed
            if (USBx_INEP(num)->DIEPINT & USB_OTG_DIEPINT_XFRC)
            {
                USBx_INEP(num)->DIEPINT = USB_OTG_DIEPINT_XFRC;
                SyncWriteEP = 1;
                if (USBD_P_EP[num])
                {
                    USBD_P_EP[num](USBD_EVT_IN);
                }
                SyncWriteEP = 0;
            }
        }
    }

    NVIC_EnableIRQ(OTG_HS_IRQn);
}
